.eqv N 18                 # константа - Старчиков А.С. - 18. М30-138СВ-26

.text                    # операция
main:			#метка начало программы
    li   a7, 5           # загружаем в регистр а7 число 5,т.о. код вызова "прочитать целое"
    ecall                # выполним системный вызов, введенное число попадает в а0
    li   t0, N           # загрузим в регистр t0 значение 18
    li   t1, 0           # запишем в регистр t1 число 0, результат не совпало
    bne  a0, t0, out     # если а0 не равно t0 то переход на метку "out"
    li   t1, 1           # Запишем в регистр t1 число 1 тогда результат "совпало"
out:			# метка при не совпадении студента
    mv   a0, t1          # скопируем результат из t1 в регистр a0
    li   a7, 1           # загрузим в регистр a7 число 1 код вызова "ввести целое"
    ecall		#выполним вызов, вывод значение a0
    li   a7, 10          # загрузим в регистр a7 число 10 код вызова "завершить программу"
    ecall		#выполним завершение программы