.eqv SIZE 34             # 16 + N (N = 18)константа мой номер Старчиков А.С.

.data			#начало секции данных
arr:    .space 256       # Зарезервируем 256 байт памяти, метка arr указывает на начало массива

.text
main:
    la   t0, arr         # Загрузим в регистр t0 адрес метки arr, то есть указатель на начало массива
    li   t1, 0           # Запишем в регистр t1 число 0, это будет счётчик считанных значений
    li   t2, SIZE 		# Загрузим в регистр t2 значение константы SIZE, сколько всего нам нужно посчитать
loop:			#метка начало цикла
    bge  t1, t2, done    # Если t1 больше или равно t2, то перейти на done, то есть все значения считаны
    li   a7, 5           # загружаем в регистр а7 число 5,т.о. код вызова "прочитать целое"
    ecall	#системный вызов
    beqz a0, done        # Если a0 равно нулю, то перейти на done, то есть введён ноль, чтение закончено
    sw   a0, 0(t0)       # Запишет слово из a0 в память по адресу из t0
    addi t0, t0, 4	#увеличение значение к t0 число 4, то есть сдвинуть указатель на следующую ячейку (слово 4 байта)
    addi t1, t1, 1	#счетчик увеличим на 1
    j    loop		#переход на метку loop
done:		#метка конец чтения
    mv   a0, t1          # Скопировать счётчик в a0
    li   a7, 1		#Вывести, сколько чисел записано
    ecall	#системный вызов
    li   a7, 10		#Завершить программу
    ecall	#системный вызов