.eqv N 18                 # константа - Старчиков А.С. М30-138СВ-26

.text                    # операция
main:
    li   a7, 5           # просим услугу «прочитать число»
    ecall                # выполняем: введённое число окажется в a0
    li   t0, N           # t0 = N (номер студента)
    li   t1, 0           # t1 = 0, это будущий ответ (пока «не совпало»)
    bne  a0, t0, out     # если x != N, прыгаем на out (ответ остаётся 0)
    li   t1, 1           # сюда дошли только если x == N, значит ответ = 1
out:
    mv   a0, t1          # копируем ответ в a0, чтобы вывести
    li   a7, 1           # услуга «вывести число»
    ecall
    li   a7, 10          # услуга «завершить программу»
    ecall