.eqv G 138               # константа 138 - моя группа( y)
.eqv N 18                 # константа 18 - мой номер( h) в списке Старчиков А.С.

.text
main:
    li   a7, 5           # загружаем в регистр а7 число 5,т.о. код вызова "прочитать целое"
    ecall		#выполним системный вызов, введенное число попадает в а0
    mv   t0, a0          # Скопируем введённое число в t0 (t0=x)
    li   t1, G           # загрузим в регистр t1 значение константы группы(138) т.о. t1 =y
    ble  t0, t1, ordered # если x <= y,тогда перейдем на метку "ordered"
    mv   t2, t0          # скопируем t0 в временный регистр t2
    mv   t0, t1		# скопируем t1 в t0
    mv   t1, t2		#скопируем t2 в t1 - завершение обмен значений
ordered:                 # метка где t0 это минимум, а t1 максимум
    li   t3, N           # загрузим в регистр t3 значение константы номер студента, это шаг h
loop:			# метка начала цикла
    bgt  t0, t1, done  # если t0 > t1 , перейдем на метку "done"- т.о. ввыйти из цикла
    mv   a0, t0		# скопируем число в a0 для вывода
    li   a7, 1           # загрузим в регистр a7 число 1 код вызова "ввести целое"
    ecall		# выполняем системный вызов
    li   a0, 32          # загрузим в регистр а0 число 32 (ASCII код вызова пробела)
    li   a7, 11          # выведем символ, кот которого лежит в а0 т.е. пробел
    ecall		# выполняем системный вызов
    add  t0, t0, t3      # прибавим к t0 значение t3 и запишем результат в t0 т.о. увеличим число на шаг
    j    loop		# безусловный переход на метку loop, следующая итерация
done:		# метка конец программы
    li   a7, 10		#завершение программы 
    ecall	#системный вызов